#include "pch.h"
// 这一文件不提供任何函数或参数，仅用于说明使用方法

/*访问 https ://prts.wiki/w/%E5%89%A7%E6%83%85%E4%B8%80%E8%A7%88 来获得标题

可接受的标题格式：
主线\SideStory\故事集(直接复制网页内容):  JT8-3 昂首，足践烈焰 行动后 ； 罐头里有什么 ； AS-ST-2 苏醒的城市
干员密录 ： 衡沙/干员密录/1；普罗旺斯/干员密录/2；

将标题复制到剪贴板，选择“粘贴并访问”来到对应页面；你也可以粘贴到上方的文本框后选择“访问”
一般情况下，是否加上后缀都应当选“是”，只有在处理干员密录时才需要选择“否”

如果发现页面显示“需要登录”，说明你查询的页面不存在，有三种情况
1.标题格式错误
2.是否加上后缀
3.wiki上并未更新该剧情

成功进入网页后，你将看见一个大的文件编辑框，里面是对应的剧情代码，右键将其全部选中（尽量不要选择第一行和最后一行），然后选择“获取文本”

随后，整个界面将被刷新，重新回到初始状态，此时，结果已经写入你的剪贴板，可以在Word中粘贴


如果wiki上尚未更新剧情，你也可以通过剧情解包的方式获得在网页上右键选中的代码，将对应的txt文件拖入右侧空白，点击“获取文本”即可
什么，你问怎么解包？
请自行下载软件 assetstudiogui， 并在 Android/data/com.hypergryph.arknights/files/AB/Android/gamedata/story 中获取对应的.ab文件解包


最后，该程序运行时需要使用文件 ./data/check.ini, 请确保你在移动可执行文件时一同转移

yj的剧情不时会加上更多的命令，如果发现处理后的程序仍有代码，请参照以下步骤处理

1.倘若这一整行均是代码，没有剧情文本，请复制前五个字符到 ./data/check.ini 中并保存，注意中括号算一个字符，同时请多复制一份，有的时候第一个字母可能是大写也可能是小写
2.倘若这一整行中有文本，请联系我进行解决；在未修复之前，先通过Word的替换功能手动应应急


至于“工具”一栏，仅用于个人特殊用途，无需使用。
*/